In [ ]:
#pandas : - is an open source python library providing high performance data
#manipulation and
#analysis tool using powerful data structures .

''' There are 2 types of data 
1. structured data    2. unstructured data 
1. structured data : to store data in tabular form  : ms-excel ,csv file, sql file 
2. unstructured data : text format ,image format ,video .audio'''

#1. clearing data /data preprocessing : 
#a. to handle null value   
#b. to find outlier and remove 
#c. skewness reduce
#2. Exploring the data
#3. Collecting the data

#Pandas library developed in 2008 by McKinney

In [ ]:
'''Pandas deals with the following three data structures
1. Series means 1D array means many rows means many records but only one column
2. DataFrame means 2D array means many rows means many records and in one row,many columns
means to store data in tabular format means matrix format
3. Panel means 3D array'''

In [ ]:
'''
Why Use Pandas?
Pandas allows us to analyze big data and make conclusions based on 
statistical theories.

Pandas can clean messy data sets, and make them readable and relevant.

Relevant data is very important in data science.
'''

In [2]:
#firstly installing pandas
#!pip install pandas

Requirement already satisfied: pandas in c:\users\admin\appdata\local\programs\python\python39\lib\site-packages (1.3.5)
Requirement already satisfied: numpy>=1.17.3 in c:\users\admin\appdata\local\programs\python\python39\lib\site-packages (from pandas) (1.21.5)
Requirement already satisfied: python-dateutil>=2.7.3 in c:\users\admin\appdata\local\programs\python\python39\lib\site-packages (from pandas) (2.8.2)

WARNING: You are using pip version 21.1.3; however, version 21.3.1 is available.
You should consider upgrading via the 'c:\users\admin\appdata\local\programs\python\python39\python.exe -m pip install --upgrade pip' command.

Requirement already satisfied: pytz>=2017.3 in c:\users\admin\appdata\local\programs\python\python39\lib\site-packages (from pandas) (2021.3)
Requirement already satisfied: six>=1.5 in c:\users\admin\appdata\local\programs\python\python39\lib\site-packages (from python-dateutil>=2.7.3->pandas) (1.16.0)

In [1]:
import pandas as pd

In [4]:
#to show version 
pd.__version__

'1.1.3'

In [5]:
#Data Structure of Panda
#1. Series : - 
'''
Series is a one-dimensional array like structure with homogeneous data. 
Key Points of series : 

1. Homogeneous data
2. Size Immutable
3. Values of Data Mutable
'''

'\nSeries is a one-dimensional array like structure with homogeneous data. \nKey Points of series : \n\n1. Homogeneous data\n2. Size Immutable\n3. Values of Data Mutable\n'

In [6]:
#creating a simple panda series with the help of
#1. list 2. 1D NumPy array 3. Dictionary

#creating a simple panda series with the help of list
x=[23,56,89,10,30,45,60]
print(type(x))
print(x)

<class 'list'>
[23, 56, 89, 10, 30, 45, 60]

In [7]:
#converting list into series data structure\
a=pd.Series(x)
print(type(a))
print (a)

<class 'pandas.core.series.Series'>
0    23
1    56
2    89
3    10
4    30
5    45
6    60
dtype: int64

In [10]:
#accessing data from series:-
#1. via indexing
#2. via slicing

print(a[2])

89

In [12]:
# accessing multiple index
a[[2,6]] #you need to pass a list while accessing multiple data

2    89
6    60
dtype: int64

In [14]:
#through slicing
#from 2nd to 5th index
a[2:6]

2    89
3    10
4    30
5    45
dtype: int64

In [16]:
#accesing last 3 element
a[-3:]

4    30
5    45
6    60
dtype: int64

In [18]:
#first 5
a[:5:]

0    23
1    56
2    89
3    10
4    30
dtype: int64

In [21]:
#head() :inbuilt function :to show first 5 record by default\
a.head()

0    23
1    56
2    89
3    10
4    30
dtype: int64

In [23]:
#head() :inbuilt function :to show first 5 record by default\
#first 3 using head function
a.head(3)

0    23
1    56
2    89
dtype: int64

In [24]:
#tail() :inbuilt function :to show last 5 record by default\
a.tail()

2    89
3    10
4    30
5    45
6    60
dtype: int64

In [25]:
#head() :inbuilt function :to show first 5 record by default\
#last 3 using head function
a.tail(3)

4    30
5    45
6    60
dtype: int64

In [36]:
#having your own index
x=[10,20,30,40,50,60,70]
a=pd.Series (x,index=['a','b','c','d','e','f','g'])  #indexing should match the total elemnetin the list
print(a)

a    10
b    20
c    30
d    40
e    50
f    60
g    70
dtype: int64

In [37]:
a['b']

20

In [38]:
print(a['b':'f'])

b    20
c    30
d    40
e    50
f    60
dtype: int64

In [40]:
print(a[['b','f']])

b    20
f    60
dtype: int64

In [41]:
#creating Series with the help of dictionary
#the dict consist of key and value so the key becomes the index of the series\
d={'Rno':120,'Name':'Deepa Pandey','age':23,'City':'Mumbai'}
print (type(d))
print(d)

<class 'dict'>
{'Rno': 120, 'Name': 'Deepa Pandey', 'age': 23, 'City': 'Mumbai'}

In [43]:
#converting to Series
s=pd.Series(d)
print(type(s))
print(s)

<class 'pandas.core.series.Series'>
Rno              120
Name    Deepa Pandey
age               23
City          Mumbai
dtype: object

In [44]:
#ACCESSING VALUES
#Rno and age
s[['Rno','age']]

Rno    120
age     23
dtype: object

In [45]:
#ACCESSING VALUES
#via slicing
s['Rno':'age']

Rno              120
Name    Deepa Pandey
age               23
dtype: object

In [2]:
#2nd data structure of pandas : DataFrame 
#DataFrame means 2D array   

#2. DataFrame(): inbuilt function of pandas library
#DataFrame : creates a 2D array means two dimensional array means many rows 
#and in each row,many columns means to hold data in tabular form
#means collection of 2 or more Series are creates DataFrame
''' 
Name    Age    Mobile   Email
Anu      23 9876545678  Anu@itvedant.com
Seema    31 7689765432  Seema@itvedant.com

Keypoints of DataFrame : -
1. Heterogeneous Data for eg. in above table : Name is string type , Age is
int type , mobile is int type and Email is string type
2. Data Mutable means can be changed
3. Size Mutable
'''

' \nName    Age    Mobile   Email\nAnu      23 9876545678  Anu@itvedant.com\nSeema    31 7689765432  Seema@itvedant.com\n\nKeypoints of DataFrame : -\n1. Heterogeneous Data for eg. in above table : Name is string type , Age is\nint type , mobile is int type and Email is string type\n2. Data Mutable means can be changed\n3. Size Mutable\n'

In [3]:
#create  DataFrame with the help of nested list
x=[['Anu',23,'Mumbai'],['Rekha',21,'Pune'],['Leena',25,'Mumbai'],
   ['Sarin',32,'Delhi']]
print(type(x))
print(x)

<class 'list'>
[['Anu', 23, 'Mumbai'], ['Rekha', 21, 'Pune'], ['Leena', 25, 'Mumbai'], ['Sarin', 32, 'Delhi']]

In [4]:
#creating DataFrame
pd.DataFrame(x)

       0   1       2
0    Anu  23  Mumbai
1  Rekha  21    Pune
2  Leena  25  Mumbai
3  Sarin  32   Delhi

In [8]:
#Giving name to coloumn
student=pd.DataFrame(x,columns=['Name','age','City'])
print(student)
print(type(student))

    Name  age    City
0    Anu   23  Mumbai
1  Rekha   21    Pune
2  Leena   25  Mumbai
3  Sarin   32   Delhi
<class 'pandas.core.frame.DataFrame'>

In [13]:
#accessing names of all student
print(student["Name"])
#or
print(student.Name)

0      Anu
1    Rekha
2    Leena
3    Sarin
Name: Name, dtype: object
0      Anu
1    Rekha
2    Leena
3    Sarin
Name: Name, dtype: object

In [11]:
#accessing names of all student with city
student[["Name","City"]]

    Name    City
0    Anu  Mumbai
1  Rekha    Pune
2  Leena  Mumbai
3  Sarin   Delhi

In [16]:
#Access all details of second student
#student[1]# showing error
student.iloc[1] #iloc[rowindex] :iloc means index location

Name    Rekha
age        21
City     Pune
Name: 1, dtype: object

In [18]:
#Access only age details of second student
#student[1,1]# showing error
student.iloc[1,1] #iloc[rowindex,columnindex] :iloc means index location

21

In [21]:
#another method
student.loc[1,'age']#loc[rowindex,'columnName']

21

In [23]:
#without using Iloc and loc
student["age"][1]#DataFrameName['column name'][Roindex]

21

In [25]:
#to sho all column name of selected dataframe, use inbuilt method and answer 
#will return in list
student.columns

Index(['Name', 'age', 'City'], dtype='object')

In [29]:
#use slicing
#access details of 2nd and 3rd stdent
student.iloc[1:3:] #dataframeName.iloc[start:stop:step,all columns]

    Name  age    City
1  Rekha   21    Pune
2  Leena   25  Mumbai

In [30]:
#acces age , city of 2nd 3rd student
student.iloc[1:3,1:]
#iloc[roindex start:roindex stop,colindex start:till end col]

   age    City
1   21    Pune
2   25  Mumbai

In [33]:
#to access last col of all student
student.iloc[:,-1]

0    Mumbai
1      Pune
2    Mumbai
3     Delhi
Name: City, dtype: object

In [2]:
import numpy as np
np.nan

nan

In [35]:
#creating DataFrame from Dictionary
d={'Name':['Anu','Rekha','Pankaj','Deepak','Renu'],
  'Age':[21,32,np.nan,34,np.nan],'City':['Mumbai',np.nan,'Pune','Delhi',
                                         'Mumbai']}
print(type(d))
print(d)

<class 'dict'>
{'Name': ['Anu', 'Rekha', 'Pankaj', 'Deepak', 'Renu'], 'Age': [21, 32, nan, 34, nan], 'City': ['Mumbai', nan, 'Pune', 'Delhi', 'Mumbai']}

In [38]:
#converting into dataframe
student=pd.DataFrame(d)
print(type(student))
print(student)

<class 'pandas.core.frame.DataFrame'>
     Name   Age    City
0     Anu  21.0  Mumbai
1   Rekha  32.0     NaN
2  Pankaj   NaN    Pune
3  Deepak  34.0   Delhi
4    Renu   NaN  Mumbai

In [41]:
student.info()#inbuilt function to show all details of the dataframe

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    5 non-null      object
 1   Age     3 non-null      float64
 2   City    4 non-null      object
dtypes: float64(1), object(2)
memory usage: 248.0+ bytes

In [45]:
#to check null value
student.isnull() #returns boolion value i.e true or false

    Name    Age   City
0  False  False  False
1  False  False   True
2  False   True  False
3  False  False  False
4  False   True  False

In [46]:
#counting null values
student.isnull().sum()

Name    0
Age     2
City    1
dtype: int64

In [47]:
#shape ; inbuilt methode ; to show number of  row and col
student.shape #returns tupple (no. of row, no of col)

(5, 3)

In [49]:
#find percentage of null value
student.isnull().sum()*100/student.shape[0] #df.isnull().sum()*100/student.shape[0index]

Name     0.0
Age     40.0
City    20.0
dtype: float64

In [53]:
#treating null value
#fill age by mean value of age
#finding mean
m=student['Age'].mean() #mean is function of numpy
print('mean og age =', m)
student ['Age'].fillna(m)#temperoy fill

mean og age = 29.0

0    21.0
1    32.0
2    29.0
3    34.0
4    29.0
Name: Age, dtype: float64